"use strict";

var a = 0.1;
var b = 0.2;
console.log((a + b).toFixed(1));
alert("taskMin1");
alert("Привіт, Друже, ти знову завітав до мене. Ти здивуєшся але согодні в нас знову математика. 0.1 + 0.2 буде 0.3 якщо використаэмо оператора 'toFixed()'.");
alert("Приклад: console.log ((a + b).toFixed(1))");
alert("taskMin2"); // let a = '1';
// let b = 2;
// console.log(parseInt(a) + b)

alert("Далі додамо до рядка `1` цифру 2, і використаємо `parseInt()`");
alert("Приклад: console.log(parseInt(a) + b)");
alert("taskMin3");
var fleshSize = prompt("А тепер, задача. Скажи мені на скільки гіг твоя флешка, а я скажу тобі скільки фільмів розміром 820Mb у неї влізе");
var mbSize = fleshSize * 1024;
if (fleshSize.replace(/\d/g, '').length) alert('Я не зрозумів, і тепер прийдеться пропустити цю частину');
alert("\u042F\u043A\u0449\u043E \u0442\u0432\u043E\u044F \u0444\u043B\u0435\u0448\u043A\u0430 \u043D\u0430 ".concat(fleshSize, " Gb , \u0442\u043E \u0432 \u0442\u0435\u0431\u0435 \u0432\u043B\u0456\u0437\u0435 ").concat(Math.floor(mbSize / 820), " \u0444\u0456\u043B\u044C\u043C\u0456\u0432 \u0440\u043E\u0437\u043C\u0456\u0440\u043E\u043C 820Mb"));
alert("taskNorm1");
var moneyCash = prompt("*І знову за рибу гроші*, так ми знову рахуємо твої гроші. Скажи скльки грошиків є в твоєму гаманці?");
var chocolatePrice = prompt("А тепер скажи, скільки коштує плитка шоколаду в магазині на рогом? Тільки вводи не дуже дорогий, а то на багато не вистачить:)");
var balanceOfMoney = Math.floor(moneyCash / chocolatePrice);
var differenceMoney = moneyCash - balanceOfMoney * chocolatePrice;
var moneyOff = chocolatePrice - differenceMoney;
alert("\u041F\u0456\u0441\u043B\u044F \u043D\u0435\u0441\u043A\u043B\u0430\u0434\u043D\u0438\u0445 \u0434\u0456\u0439 \u043C\u0438 \u0432\u0436\u0435 \u0437\u043D\u0430\u0454\u043C\u043E, \u0449\u043E \u0442\u0438 , \u0414\u0440\u0443\u0436\u0435, \u043C\u043E\u0436\u0435\u0448\u044C \u043F\u043E\u043B\u0430\u0441\u0443\u0432\u0430\u0442\u0438 \u043B\u0438\u0448\u0435 ".concat(balanceOfMoney, " \u043F\u043B\u0438\u0442\u043E\u0447\u043A\u0430\u043C\u0438, \u0441\u043C\u0430\u0449\u043D\u044E\u0449\u043E\u0433\u043E \u0448\u043E\u043A\u043E\u043B\u0430\u0434\u0443. \u0410\u043B\u0435 \u0432 \u0442\u0435\u0431\u0435 \u0449\u0435 \u0437\u0430\u043B\u0438\u0448\u0438\u043B\u043E\u0441\u044F ").concat(differenceMoney, " \u043C\u043E\u043D\u0435\u0442\u043E\u043A. \u0422\u0440\u0435\u0431\u044F, \u0449\u0435 \u0442\u0440\u043E\u0448\u043A\u0438 \u043D\u0430\u0437\u0431\u0438\u0440\u0430\u0442\u0438 \u0434\u043E \u043D\u0430\u0441\u0442\u0443\u043F\u043D\u043E\u0457 \u043F\u043B\u0438\u0442\u043E\u0447\u043A\u0438, \u0432\u0441\u044C\u0433\u043E ").concat(moneyOff, " \u043C\u043E\u043D\u0435\u0442\u043E\u043A. \u0426\u0456\u043D\u0430 \u0442\u043E \"").concat(chocolatePrice, "\" \u0434\u044D\u043D\u044E\u0448\u0435\u043A."));
alert("taskNorm2");
var anyNomber = prompt("І на останок (бо оченята і в тебе і мене вже зліпаються) покажу тобі фокус, але ти його напевно знаєшь. Так от, загадай будь яке число (до 10 символів, щоб скоріше було), і напиши мені, а я його покажу навпаки! Бачиш, як вмію! Ну пиши вже");
var arrayNumber = Array.from(anyNomber).reverse().join('');
alert("\u0422\u0420\u0410\u041C-\u0422\u0410-\u0420\u0410-\u0420\u0410\u041C \u0442\u0432\u043E\u0454 \u043F\u0435\u0440\u0435\u0432\u0435\u0440\u043D\u0435\u0442\u0435 \u0447\u0438\u0441\u043B\u043E ".concat(arrayNumber, ".\n                    \u0410 ! \u041D\u0443 \u044F\u043A! \u0421\u043F\u043E\u0434\u043E\u0431\u0430\u043B\u043E\u0441\u044F?\n \u0422\u0430 \u044F \u0437\u043D\u0430\u044E, \u0449\u043E \u0442\u0438 \u0437\u043D\u0430\u0454\u0448\u044C, \u0434\u044F\u043A\u0443\u044E, \u0449\u043E \u043F\u043E\u043A\u0430\u0437\u0430\u0432 \u0446\u0435 \u043D\u0430 \u0443\u0440\u043E\u0446\u0456, \u0431\u043E \u0456\u043D\u0430\u043A\u0448\u0435 \u0441\u0438\u0434\u0456\u0434\u0438 \u043C\u0435\u043D\u0456 \u0456 \u0441\u0438\u0434\u0456\u0442\u0438 \u0437\u0430 \u043A\u043E\u043C\u043F\u043E\u043C \u0434\u043E \u0442\u0440\u0435\u0442\u044C\u043E\u0457 \u0433\u043E\u0434\u0438\u043D\u0438. \u0414\u044F\u043A\u0443\u044E \u0437\u0430 \u0443\u0432\u0430\u0433\u0443. \u041F\u0440\u0438\u0445\u043E\u0434\u044C\u0442\u0435 \u043D\u0430\u0441\u0442\u0443\u043F\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u0443, \u043C\u043E\u0436\u0435 \u044F \u0449\u043E\u0441\u044C \u043D\u043E\u0432\u0435\u043D\u044C\u043A\u0435 \u0432\u0438\u0432\u0447\u0443. \u0420\u0430\u0434\u0438\u0439 \u0431\u0443\u0432 \u0412\u0430\u0441 \u0431\u0430\u0447\u0438\u0442\u0438."));